In [22]:
import pandas as pd
import numpy as np

In [23]:
df = pd.read_excel(
    r"C:\Users\Sahib Alizada\Desktop\SHB\Real Projects\2\Raw data\online_retail_II.xlsx",
    sheet_name="Year 2010-2011"
)

In [24]:
print(df.head())

  Invoice StockCode                          Description  Quantity  \
0  536365    85123A   WHITE HANGING HEART T-LIGHT HOLDER         6
1  536365     71053                  WHITE METAL LANTERN         6
2  536365    84406B       CREAM CUPID HEARTS COAT HANGER         8
3  536365    84029G  KNITTED UNION FLAG HOT WATER BOTTLE         6
4  536365    84029E       RED WOOLLY HOTTIE WHITE HEART.         6

          InvoiceDate  Price  Customer ID         Country
0 2010-12-01 08:26:00   2.55      17850.0  United Kingdom
1 2010-12-01 08:26:00   3.39      17850.0  United Kingdom
2 2010-12-01 08:26:00   2.75      17850.0  United Kingdom
3 2010-12-01 08:26:00   3.39      17850.0  United Kingdom
4 2010-12-01 08:26:00   3.39      17850.0  United Kingdom

In [25]:
print(df.shape)

(541910, 8)

In [26]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541910 entries, 0 to 541909
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      541910 non-null  object
 1   StockCode    541910 non-null  object
 2   Description  540456 non-null  object
 3   Quantity     541910 non-null  int64
 4   InvoiceDate  541910 non-null  datetime64[ns]
 5   Price        541910 non-null  float64
 6   Customer ID  406830 non-null  float64
 7   Country      541910 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB
None

In [27]:
df["Customer ID"].isnull().sum()

np.int64(135080)

In [28]:
df[df["Customer ID"].isna()].head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
622,536414,22139,NaN,56,2010-12-01 11:52:00,0.00,NaN,United Kingdom
1443,536544,21773,DECORATIVE ROSE BATHROOM BOTTLE,1,2010-12-01 14:32:00,2.51,NaN,United Kingdom
1444,536544,21774,DECORATIVE CATS BATHROOM BOTTLE,2,2010-12-01 14:32:00,2.51,NaN,United Kingdom
1445,536544,21786,POLKADOT RAIN HAT,4,2010-12-01 14:32:00,0.85,NaN,United Kingdom
1446,536544,21787,RAIN PONCHO RETROSPOT,2,2010-12-01 14:32:00,1.66,NaN,United Kingdom

In [29]:
df = df[~df["Customer ID"].isna()]

In [30]:
print(df.shape)

(406830, 8)

In [31]:
df[df["Quantity"]<=0].shape

(8905, 8)

In [32]:
df[df["Quantity"]<=0].head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
141,C536379,D,Discount,-1,2010-12-01 09:41:00,27.50,14527.0,United Kingdom
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,2010-12-01 09:49:00,4.65,15311.0,United Kingdom
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,2010-12-01 10:24:00,1.65,17548.0,United Kingdom
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom

In [33]:
df=df[df["Quantity"]>0]

In [34]:
print(df.shape)

(397925, 8)

In [35]:
df[df["Price"] <= 0].shape

(40, 8)

In [36]:
df[df["Price"] <= 0].head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
9302,537197,22841,ROUND CAKE TIN VINTAGE GREEN,1,2010-12-05 14:02:00,0.0,12647.0,Germany
33576,539263,22580,ADVENT CALENDAR GINGHAM SACK,4,2010-12-16 14:36:00,0.0,16560.0,United Kingdom
40089,539722,22423,REGENCY CAKESTAND 3 TIER,10,2010-12-21 13:45:00,0.0,14911.0,EIRE
47068,540372,22090,PAPER BUNTING RETROSPOT,24,2011-01-06 16:41:00,0.0,13081.0,United Kingdom
47070,540372,22553,PLASTERS IN TIN SKULLS,24,2011-01-06 16:41:00,0.0,13081.0,United Kingdom

In [37]:
df = df[df["Price"] > 0]

In [38]:
print(df.shape)

(397885, 8)

In [39]:
df[df["Description"].isna()].shape

(0, 8)

In [40]:
df[df["Description"] == "?"].shape

(0, 8)

In [41]:
df["Description"].isnull().sum()

np.int64(0)

In [42]:
df["StockCode"].value_counts().head(20)

StockCode
85123A    2035
22423     1723
85099B    1618
84879     1408
47566     1396
20725     1317
22720     1159
20727     1105
POST      1100
23203     1098
22383     1083
22197     1068
21212     1068
23209     1029
23298     1024
22086     1019
22382     1008
20728      989
22469      985
22457      980
Name: count, dtype: int64

In [43]:
non_product_codes = ["POST", "D", "BANK CHARGES"]
df = df[~df["StockCode"].isin(non_product_codes)]

In [44]:
print(df.shape)

(396773, 8)

In [45]:
df.isnull().sum()

Invoice        0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
Price          0
Customer ID    0
Country        0
dtype: int64

In [46]:
df.describe()

,Quantity,InvoiceDate,Price,Customer ID
count,396773.000000,396773,396773.000000,396773.000000
mean,13.016712,2011-07-10 23:57:16.865411840,3.037353,15301.474543
min,1.000000,2010-12-01 08:26:00,0.001000,12346.000000
25%,2.000000,2011-04-07 11:12:00,1.250000,13975.000000
50%,6.000000,2011-07-31 14:39:00,1.950000,15159.000000
75%,12.000000,2011-10-20 14:40:00,3.750000,16801.000000
max,80995.000000,2011-12-09 12:50:00,4161.060000,18287.000000
std,179.581829,NaN,17.829898,1709.862357

In [48]:
snapshot_date = df["InvoiceDate"].max() + pd.Timedelta(days=1)
snapshot_date

Timestamp('2011-12-10 12:50:00')

In [49]:
rfm = df.groupby("Customer ID").agg({
    "InvoiceDate": lambda x: (snapshot_date - x.max()).days,
    "Invoice": "nunique",
    "Price": lambda x: (x * df.loc[x.index, "Quantity"]).sum()
})

rfm.columns = ["Recency", "Frequency", "Monetary"]
rfm.head()

             Recency  Frequency  Monetary
Customer ID
12346.0          326          1  77183.60
12347.0            2          7   4310.00
12348.0           75          4   1437.24
12349.0           19          1   1457.55
12350.0          310          1    294.40

In [50]:
rfm["R_Score"] = pd.qcut(rfm["Recency"], 5, labels=[5,4,3,2,1])
rfm["F_Score"] = pd.qcut(rfm["Frequency"].rank(method="first"), 5, labels=[1,2,3,4,5])
rfm["M_Score"] = pd.qcut(rfm["Monetary"], 5, labels=[1,2,3,4,5])

In [52]:
rfm["RFM_Score"] = rfm["R_Score"].astype(str) + rfm["F_Score"].astype(str) + rfm["M_Score"].astype(str)
rfm.head()

             Recency  Frequency  Monetary R_Score F_Score M_Score RFM_Score
Customer ID
12346.0          326          1  77183.60       1       1       5       115
12347.0            2          7   4310.00       5       5       5       555
12348.0           75          4   1437.24       2       4       4       244
12349.0           19          1   1457.55       4       1       4       414
12350.0          310          1    294.40       1       1       2       112

In [56]:
def segment_customer(row):
    if row["R_Score"] == 5 and row["F_Score"] == 5:
        return "Champions"
    elif row["R_Score"] >= 4 and row["F_Score"] >= 4:
        return "Loyal Customers"
    elif row["R_Score"] <= 2 and row["F_Score"] >= 4:
        return "At Risk"
    elif row["R_Score"] == 1:
        return "Lost Customers"
    else:
        return "Potential Loyalists"

rfm["Segment"] = rfm.apply(segment_customer, axis=1)
rfm["Segment"].value_counts()

Segment
Potential Loyalists    2121
Lost Customers          805
Loyal Customers         695
Champions               443
At Risk                 273
Name: count, dtype: int64

In [57]:
rfm.shape

(4337, 8)

In [58]:
rfm.reset_index(inplace=True)
rfm.head()

,Customer ID,Recency,Frequency,Monetary,R_Score,F_Score,M_Score,RFM_Score,Segment
0,12346.0,326,1,77183.60,1,1,5,115,Lost Customers
1,12347.0,2,7,4310.00,5,5,5,555,Champions
2,12348.0,75,4,1437.24,2,4,4,244,At Risk
3,12349.0,19,1,1457.55,4,1,4,414,Potential Loyalists
4,12350.0,310,1,294.40,1,1,2,112,Lost Customers

In [59]:
rfm.to_csv("rfm_customer_segments.csv", index=False)